In [2]:
!pip3 install sqlalchemy # ORM for databases
!pip3 install ipython-sql # SQL magic function

Requirement already satisfied: sqlalchemy in /usr/local/lib/python3.10/dist-packages (2.0.36)
Requirement already satisfied: typing-extensions>=4.6.0 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy) (4.12.2)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy) (3.1.1)
Requirement already satisfied: ipython-sql in /usr/local/lib/python3.10/dist-packages (0.5.0)
Requirement already satisfied: prettytable in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (3.11.0)
Requirement already satisfied: ipython in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (7.34.0)
Requirement already satisfied: sqlalchemy>=2.0 in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (2.0.36)
Requirement already satisfied: sqlparse in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (0.5.1)
Requirement already satisfied: six in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython-genutils in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: typing-extensions>=4.6.0 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy>=2.0->ipython-sql) (4.12.2)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy>=2.0->ipython-sql) (3.1.1)
Requirement already satisfied: setuptools>=18.5 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (75.1.0)
Collecting jedi>=0.16 (from ipython->ipython-sql)
  Downloading jedi-0.19.1-py2.py3-none-any.whl.metadata (22 kB)
Requirement already satisfied: decorator in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (4.4.2)
Requirement already satisfied: pickleshare in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: traitlets>=4.2 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (5.7.1)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (3.0.48)
Requirement already satisfied: pygments in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (2.18.0)
Requirement already satisfied: backcall in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: matplotlib-inline in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.1.7)
Requirement already satisfied: pexpect>4.3 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (4.9.0)
Requirement already satisfied: wcwidth in /usr/local/lib/python3.10/dist-packages (from prettytable->ipython-sql) (0.2.13)
Requirement already satisfied: parso<0.9.0,>=0.8.3 in /usr/local/lib/python3.10/dist-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.4)
Requirement already satisfied: ptyprocess>=0.5 in /usr/local/lib/python3.10/dist-packages (from pexpect>4.3->ipython->ipython-sql) (0.7.0)
Downloading jedi-0.19.1-py2.py3-none-any.whl (1.6 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 1.6/1.6 MB 20.4 MB/s eta 0:00:00
Installing collected packages: jedi
Successfully installed jedi-0.19.1

In [3]:
%load_ext sql

## Connect With Your Credentials

The current connection string DOES NOT WORK!   
Make sure to change the YOURUSER:YOURPASSWORD part of the connection string to your team's account information!

In [10]:
#create tables
%%sql
DROP table if exists Users CASCADE;
CREATE TABLE Users(
	  user_id SERIAL PRIMARY KEY,
    user_name VARCHAR(50) NOT NULL,
    email VARCHAR(100) NOT NULL UNIQUE,
    phone_number VARCHAR(15) NOT NULL,
    password VARCHAR(100) NOT NULL
);
INSERT INTO Users (user_name, email, phone_number, password)
VALUES
    ('Ava Smith', 'ava.smith@example.com', '5551234567','ajgebghg'),
    ('James Johnson', 'james.johnson@example.com', '5552345678','jiejgtv'),
    ('Mia Robinson', 'mia.robinson@example.com', '5553456789','ienchtf'),
    ('Liam Brown', 'liam.brown@example.com', '5554567890','nishge'),
    ('Emma Garcia', 'emma.garcia@example.com', '5555678901','jienfa'),
    ('Oliver Martinez', 'oliver.martinez@example.com', '5556789012','zezfnies'),
    ('Isabella Davis', 'isabella.davis@example.com', '5557890123','znihgveg'),
    ('Ethan Wilson', 'ethan.wilson@example.com', '5558901234','znifgeg'),
    ('Sophia Anderson', 'sophia.anderson@example.com', '5559012345','digje'),
    ('Noah Clark', 'noah.clark@example.com', '5550123456','sgedgegeh');

 * postgresql://zx2514:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/w4111
Done.
Done.
10 rows affected.

[]

In [7]:
#create tables
%%sql
DROP table if exists Bank CASCADE;

CREATE TABLE Bank(
	  bank_id SERIAL PRIMARY KEY,
    bank_name VARCHAR(50) NOT NULL UNIQUE
);

INSERT INTO Bank (bank_name)
VALUES
    ('Chase Bank'),
    ('Bank of America'),
    ('Wells Fargo'),
    ('Capital One'),
    ('Discover'),
    ('American Express'),
    ('Citibank'),
    ('US Bank'),
    ('PNC Bank'),
    ('Ally Bank');

 * postgresql://zx2514:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/w4111
Done.
Done.
10 rows affected.

[]

In [12]:
#create tables
%%sql
DROP table if exists Account CASCADE;

CREATE TABLE Account(
	  user_id int NOT NULL,
	  account_id SERIAL PRIMARY KEY,
    bank_id int NOT NULL,
    name VARCHAR(50) NOT NULL,
    balance int NOT NULL,
    description text,
    UNIQUE (user_id, name),
    FOREIGN KEY (user_id) REFERENCES Users(user_id)
);
INSERT INTO Account (user_id, bank_id, name, balance)
VALUES
    (1, 1, 'Chase Bank ', 1500.50),
    (1, 6, 'American Express', 3000.75),
    (2, 5, 'Discover', 2750.75),
    (2, 7, 'Citibank', 500.00),
    (3, 4, 'Capital One', 5000.00),
    (4, 4, 'Capital One', 0.00),
    (5, 2, 'Bank of America', 1250.00),
    (5, 3, 'Wells Fargo', 750.00),
    (6, 6, 'American Express', 7500.45),
    (7, 1, 'Chase Bank', 150.00),
    (7, 3, 'Wells Fargo', 250.00),
    (8, 2, 'Bank of America', 1550.00),
    (9, 1, 'Chase Bank', 1550.00),
    (10, 3, 'Wells Fargo', 910.00),
    (10, 4, 'Capital One', 550.00),
    (1, 1, 'Chase Freedom', -1200),
    (1, 6, 'Amex Gold', -800),
    (2, 7, 'Citi Premier', -2200),
    (2, 5, 'Discover It', -500),
    (4, 4, 'Capital One Credit', -3000),
    (5, 6, 'Bank of America Credit', -3000),
    (6, 6, 'Amex Platinum', -2500),
    (7, 1, 'Chase Sapphire', -600),
    (8, 6, 'Bank of America Credit', -900),
    (10, 3, 'Wells Fargo Credit', -2500);

 * postgresql://zx2514:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/w4111
Done.
Done.
25 rows affected.

[]

In [6]:
#create tables
%%sql
DROP table if exists Credit_Card CASCADE;

CREATE TABLE Credit_Card(
    user_id int NOT NULL,
	  credit_id SERIAL PRIMARY KEY,
    account_id int NOT NULL,
    settlement_day int NOT NULL,
    payment_day int NOT NULL,
    available_credit int NOT NULL,
    credit_limit int NOT NULL,
    interest_rate float NOT NULL,
    description text,
    FOREIGN KEY (user_id) REFERENCES Users(user_id),
    FOREIGN KEY (account_id) REFERENCES Account(account_id)
);
INSERT INTO Credit_Card (user_id, account_id, settlement_day, payment_day, available_credit, credit_limit, interest_rate)
VALUES
    (1, 16, 1, 10, 3800.00, 5000.00, 18.99),
    (1, 17, 5, 15, 4200.00, 5000.00, 16.49),
    (2, 18, 2, 12, 2800.00, 5000.00, 19.99),
    (2, 19, 3, 13, 2500.00, 3000.00, 20.24),
    (4, 20, 6, 16, 0.00, 3000.00, 21.49),
    (5, 21, 7, 17, 2000.00, 5000.00, 19.49),
    (6, 22, 8, 18, 4500.00, 7000.00, 15.99),
    (7, 23, 9, 19, 3400.00, 4000.00, 20.99),
    (8, 24, 10, 20, 2100.00, 3000.00, 19.99),
    (10, 25, 8, 18, 4500.00, 7000.00, 15.99);

 * postgresql://zx2514:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/w4111
Done.
Done.
10 rows affected.

[]

In [22]:
#create tables
%%sql
DROP table if exists Category CASCADE;

CREATE TABLE Category(
  category_id SERIAL PRIMARY KEY,
  category_name VARCHAR(50) NOT NULL,
  category_description text,
  UNIQUE (category_name)
);
INSERT INTO Category (category_name)
VALUES
    ('Food'),
    ('Transportation'),
    ('Entertainment'),
    ('Utilities'),
    ('Pets'),
    ('Apparel'),
    ('Health'),
    ('Education'),
    ('Beauty'),
    ('Other');

 * postgresql://zx2514:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/w4111
Done.
Done.
10 rows affected.

[]

In [24]:
#create tables
%%sql
DROP table if exists Transaction CASCADE;

CREATE TABLE Transaction(
	  transaction_id SERIAL PRIMARY KEY,
    user_id int NOT NULL,
    account_id int NOT NULL,
    trx_date date NOT NULL,
    amount int NOT NULL,
    category_id int NOT NULL,
    trx_type VARCHAR(8) CHECK (trx_type IN ('expense', 'income', 'transfer')),
    trx_description text,
    FOREIGN KEY (user_id) REFERENCES Users(user_id),
    FOREIGN KEY (account_id) REFERENCES Account(account_id),
    FOREIGN KEY (category_id) REFERENCES Category(category_id)
);
INSERT INTO Transaction (user_id, account_id, trx_date, amount, category_id, trx_type)
VALUES
    (1,1, '2024-01-05', 150.00, 1, 'expense'),
    (1,2, '2024-01-10', 200.00, 2, 'income'),
    (2,3, '2024-01-12', 75.50, 3, 'expense'),
    (2,4, '2024-01-15', 1200.00, 4, 'income'),
    (3,5, '2024-01-20', 50.00, 5, 'expense'),
    (1,1, '2024-02-01', 300.00, 1, 'income'),
    (1,2, '2024-02-05', 85.00, 6, 'expense'),
    (2,3, '2024-02-10', 150.00, 7, 'income'),
    (2,4, '2024-02-12', 100.00, 8, 'expense'),
    (3,5, '2024-02-15', 600.00, 9, 'income'),
    (4,6, '2024-02-20', 400.00, 10, 'expense'),
    (5,7, '2024-03-01', 200.00, 2, 'income'),
    (5,8, '2024-03-05', 100.00, 3, 'expense'),
    (6,9, '2024-03-10', 250.00, 4, 'income'),
    (7,10, '2024-03-12', 80.00, 5, 'expense'),
    (7,11, '2024-03-15', 500.00, 6, 'income'),
    (8,12, '2024-03-20', 300.00, 7, 'expense'),
    (9,13, '2024-04-01', 70.00, 8, 'income'),
    (10,14, '2024-04-05', 150.00, 9, 'expense'),
    (10,15, '2024-04-10', 600.00, 10, 'income');

 * postgresql://zx2514:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/w4111
Done.
Done.
20 rows affected.

[]

In [ ]:


# CREATE TABLE Investment(
# 	  investment_id SERIAL PRIMARY KEY,
# 	  account_id int NOT NULL,
#     amount int,
#     ROI float,
#     FOREIGN KEY (account_id) REFERENCES Account(account_id)
# );

# CREATE TABLE Loan(
# 	  loan_id SERIAL PRIMARY KEY,
# 	  account_id int NOT NULL,
#     principle_amount int,
#     outstanding_balance int,
#     insterest_rate float,
#     FOREIGN KEY (account_id) REFERENCES Account(account_id)
# );

 * postgresql://zx2514:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/w4111
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

In [ ]:
# see table R
%sql SELECT * FROM Users;

 * postgresql://zx2514:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/w4111
10 rows affected.

[(1, 'Ava Smith', 'ava.smith@example.com', '5551234567'),
 (2, 'James Johnson', 'james.johnson@example.com', '5552345678'),
 (3, 'Mia Robinson', 'mia.robinson@example.com', '5553456789'),
 (4, 'Liam Brown', 'liam.brown@example.com', '5554567890'),
 (5, 'Emma Garcia', 'emma.garcia@example.com', '5555678901'),
 (6, 'Oliver Martinez', 'oliver.martinez@example.com', '5556789012'),
 (7, 'Isabella Davis', 'isabella.davis@example.com', '5557890123'),
 (8, 'Ethan Wilson', 'ethan.wilson@example.com', '5558901234'),
 (9, 'Sophia Anderson', 'sophia.anderson@example.com', '5559012345'),
 (10, 'Noah Clark', 'noah.clark@example.com', '5550123456')]

In [ ]:
# see all the tables you have
%%sql SELECT *
FROM pg_catalog.pg_tables
WHERE tableowner='YOURUNI'

In [ ]:
# drop table
%sql DROP TABLE R;

In [16]:
%sql select * from Category;

 * postgresql://zx2514:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/w4111
10 rows affected.

[(1, 'Food', None),
 (2, 'Transportation', None),
 (3, 'Entertainment', None),
 (4, 'Utilities', None),
 (5, 'Pets', None),
 (6, 'Apparel', None),
 (7, 'Health', None),
 (8, 'Education', None),
 (9, 'Beauty', None),
 (10, 'Other', None)]

In [9]:
%sql SELECT * FROM Users;

 * postgresql://zx2514:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/w4111
11 rows affected.

[(1, 'Ava Smith', 'ava.smith@example.com', '5551234567', 'ajgebghg'),
 (2, 'James Johnson', 'james.johnson@example.com', '5552345678', 'jiejgtv'),
 (3, 'Mia Robinson', 'mia.robinson@example.com', '5553456789', 'ienchtf'),
 (4, 'Liam Brown', 'liam.brown@example.com', '5554567890', 'nishge'),
 (5, 'Emma Garcia', 'emma.garcia@example.com', '5555678901', 'jienfa'),
 (6, 'Oliver Martinez', 'oliver.martinez@example.com', '5556789012', 'zezfnies'),
 (7, 'Isabella Davis', 'isabella.davis@example.com', '5557890123', 'znihgveg'),
 (8, 'Ethan Wilson', 'ethan.wilson@example.com', '5558901234', 'znifgeg'),
 (9, 'Sophia Anderson', 'sophia.anderson@example.com', '5559012345', 'digje'),
 (10, 'Noah Clark', 'noah.clark@example.com', '5550123456', 'sgedgegeh'),
 (11, 'fe', 'fe', 'fe', 'fe')]

In [17]:
%sql SELECT * FROM Transaction;

 * postgresql://zx2514:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/w4111
21 rows affected.

[(1, 1, 1, datetime.date(2024, 1, 5), 150, 1, 'expense', None),
 (2, 1, 2, datetime.date(2024, 1, 10), 200, 2, 'income', None),
 (3, 2, 3, datetime.date(2024, 1, 12), 76, 3, 'expense', None),
 (4, 2, 4, datetime.date(2024, 1, 15), 1200, 4, 'income', None),
 (5, 3, 5, datetime.date(2024, 1, 20), 50, 5, 'expense', None),
 (6, 1, 1, datetime.date(2024, 2, 1), 300, 1, 'income', None),
 (7, 1, 2, datetime.date(2024, 2, 5), 85, 6, 'expense', None),
 (8, 2, 3, datetime.date(2024, 2, 10), 150, 7, 'income', None),
 (9, 2, 4, datetime.date(2024, 2, 12), 100, 8, 'expense', None),
 (10, 3, 5, datetime.date(2024, 2, 15), 600, 9, 'income', None),
 (11, 4, 6, datetime.date(2024, 2, 20), 400, 10, 'expense', None),
 (12, 5, 7, datetime.date(2024, 3, 1), 200, 2, 'income', None),
 (13, 5, 8, datetime.date(2024, 3, 5), 100, 3, 'expense', None),
 (14, 6, 9, datetime.date(2024, 3, 10), 250, 4, 'income', None),
 (15, 7, 10, datetime.date(2024, 3, 12), 80, 5, 'expense', None),
 (16, 7, 11, datetime.date(2024, 3, 15), 500, 6, 'income', None),
 (17, 8, 12, datetime.date(2024, 3, 20), 300, 7, 'expense', None),
 (18, 9, 13, datetime.date(2024, 4, 1), 70, 8, 'income', None),
 (19, 10, 14, datetime.date(2024, 4, 5), 150, 9, 'expense', None),
 (20, 10, 15, datetime.date(2024, 4, 10), 600, 10, 'income', None),
 (21, 1, 1, datetime.date(2024, 11, 15), 5, 3, 'income', None)]